SPM-Oracle/app/Controllers/Admin.php

    public function home()
    {
        #Función Home, muestra la vista de inicio de todas las funciones administrativas



        $session = session();
        $sesion_creada = $session->has('id_administrativo');

        if($sesion_creada==false){
            return redirect()->to('/'); //http://inet.utalca.cl/intranet/auth_sso
        }

        /**
         * Registra la información administrativa en usuario
         */

        $usuario=[
            'id_administrativo' => session()->get('id_administrativo'),
            'nombre' => session()->get('nombre'),
            'email' => session()->get('email')
        ];

        $convocatoriaModel = new ConvocatoriaModel();
        $movilidadModel = new MovilidadModel();
        $programaModel = new ProgramaModel();
        $postulacionModel = new PostulacionModel();

        # Busca la última convocatoria creada

        $convocatoria = $convocatoriaModel->select('*')->orderBy('ID_CONVOCATORIA', 'DESC')->first();
---
SELECT * FROM (SELECT INNER_QUERY.*, ROWNUM RNUM FROM (SELECT *
FROM "CONVOCATORIA"
ORDER BY "ID_CONVOCATORIA" DESC
) INNER_QUERY WHERE ROWNUM < 2)

                'Finalizada' => $finalizados
            ];

            $programa = $programaModel->find($convocatoria['ID_PROGRAMA']);
            $contador = count($postulacionModel->select('*')->where('ID_CONVOCATORIA', $convocatoria['ID_CONVOCATORIA'])->findAll());
---
SELECT *
FROM "PROGRAMA"
WHERE "PROGRAMA"."ID_PROGRAMA" = '4'
SELECT *
FROM "POSTULACION"
WHERE "ID_CONVOCATORIA" = '1'