SPM-Oracle/app/Controllers/Convocatoria.php

SELECT *
FROM "CONVOCATORIA"
ORDER BY "ID_CONVOCATORIA" DESC
 OFFSET 0 ROWS FETCH NEXT 25 ROWS ONLY
---
    public function index()
    {
        $session = session();
        $sesion_creada = $session->has('id_administrativo');

        if($sesion_creada==false){
            return redirect()->to('/'); //http://inet.utalca.cl/intranet/auth_sso
        }

        /**
         * Carga de Models
         */

        $convocatoriaModel = new ConvocatoriaModel();
        $programaModel = new ProgramaModel();
        $postulacionModel = new PostulacionModel();
        $preguntasModel = new PreguntaModel();

        $usuario=[
            'id_administrativo' => session()->get('id_administrativo'),
            'nombre' => session()->get('nombre'),
            'email' => session()->get('email')
        ];


        $convocatorias = $convocatoriaModel->orderBy('ID_CONVOCATORIA', 'DESC')->paginate(25);

SELECT *
FROM "PROGRAMA"
WHERE "ESTADO" = 'Activo'
SELECT *
FROM "PREGUNTA"
---

        $paginador = $convocatoriaModel->pager;
        $postulaciones = $postulacionModel-> findAll();
        $programas = $programaModel->where('ESTADO', 'Activo')->findAll();
        $preguntas = $preguntasModel->findAll();

SELECT *
FROM "POSTULACION"
WHERE "ID_CONVOCATORIA" = '1'
---
        $posicion=0;

        foreach ($convocatorias as $convocatoria){
            $contador = count($postulacionModel->where('ID_CONVOCATORIA', $convocatoria['ID_CONVOCATORIA'])->findAll());