SPM-Oracle/app/Controllers/Convocatoria.php

        $paginador = $convocatoriaModel->pager;
        $postulaciones = $postulacionModel-> findAll();
        $programas = $programaModel->where('ESTADO', 'Activo')->findAll();
        $preguntas = $preguntasModel->where('ESTADO', 'Activo')->findAll();
---
SELECT *
FROM "PREGUNTA"
WHERE "ESTADO" = 'Activo'