SPM-Oracle/app/Controllers/Estudiante.php

    public function verificador()
    {
        $session = session();

        $sesion_creada = $session->has('id_estudiante');

        if($sesion_creada==false){
            return redirect()->to('/'); //http://inet.utalca.cl/intranet/auth_sso
        }

        $convocatoriaModel = new ConvocatoriaModel();
        $postulacionModel = new PostulacionModel();
        $programaModel = new ProgramaModel();
        $carreraModel = new CarreraModel();

        $convocatoria = $convocatoriaModel->select('*')->orderBy('ID_CONVOCATORIA', 'DESC')->first();
---
SELECT * FROM (SELECT INNER_QUERY.*, ROWNUM RNUM FROM (SELECT *
FROM "CONVOCATORIA"
ORDER BY "ID_CONVOCATORIA" DESC
) INNER_QUERY WHERE ROWNUM < 2)

            'deuda_biblioteca'=>session()->get('deuda_biblioteca')
        ];

        $postulacion_check = $postulacionModel->select('*')->where('ID_CONVOCATORIA', $convocatoria['ID_CONVOCATORIA'])->findAll();
        $programa = $programaModel->find($convocatoria['ID_PROGRAMA']);
        $programas = $programaModel->findAll();
---
SELECT *
FROM "POSTULACION"
WHERE "ID_CONVOCATORIA" = '4'
SELECT *
FROM "PROGRAMA"
WHERE "PROGRAMA"."ID_PROGRAMA" = '4'

            $postulacion_multiple = true; # Bypass para multiples postulaciones
        }

        $carrera = $carreraModel->find($postulante['id_carrera']);
---
SELECT *
FROM "CARRERA"
WHERE "CARRERA"."ID_CARRERA" = '419'

    public function historial(){
        $session = session();

        if ($session->has('id_estudiante')){

            $postulacionModel = new PostulacionModel();

            $convocatoriaModel = new ConvocatoriaModel();
            $programaModel = new ProgramaModel();
            $idiomaModel = new IdiomaModel();
            $universidadModel = new UniversidadModel();
            $carreraModel = new CarreraModel();

            $postulante = [
                'id_detalle_postulante' => session()->get('id_detalle_postulante'),
                'id_estudiante' => session()->get('id_estudiante'),
                'RUT' => session()->get('RUT'),
                'nombre' => session()->get('nombre'),
                'matricula' => session()->get('matricula'),
                'nacimiento' => session()->get('nacimiento'),
                'email' => session()->get('email'),
                'sct' => session()->get('sct'),
                'estudiante_regular' => session()->get('estudiante_regular'),
                'id_carrera' => session()->get('id_carrera'),
                'carrera' => session()->get('carrera'),
                'deuda'=>session()->get('deuda'),
                'id_convocatoria'=>session()->get('id_convocatoria'),
            ];
---
SELECT *
FROM "CONVOCATORIA"
WHERE "CONVOCATORIA"."ID_CONVOCATORIA" = '1'