SPM-Oracle/app/Controllers/Formulario.php

SELECT *
FROM "PREGUNTA"
ORDER BY "ID_PREGUNTA" DESC
 OFFSET 0 ROWS FETCH NEXT 25 ROWS ONLY
---
    public function formulario()
    {
        $session = session();
        $sesion_creada = $session->has('id_administrativo');

        if($sesion_creada == false){
            return redirect()->to('/'); //http://inet.utalca.cl/intranet/auth_sso
        }

        $usuario=[
            'id_administrativo' => session()->get('id_administrativo'),
            'nombre' => session()->get('nombre'),
            'email' => session()->get('email')
        ];

        $preguntaModel = new PreguntaModel();
        $opcionesPMultipleModel = new OpcionesPMultipleModel();

        $preguntas_base = $preguntaModel->orderBy('ID_PREGUNTA', 'DESC')->paginate(25);

SELECT *
FROM "PREGUNTA"
WHERE "PREGUNTA"."ID_PREGUNTA" = '2'
---
    public function modificar()
    {
        $session = session();
        $sesion_creada = $session->has('id_administrativo');

        if($sesion_creada==false){
            return redirect()->to('/'); //http://inet.utalca.cl/intranet/auth_sso
        }

        $preguntaModel = new PreguntaModel();

        $aux = $this->request->getVar('id_pregunta');

        $pregunta = $preguntaModel->find($aux);

UPDATE "PREGUNTA" SET "TIPO" = 'Individual', "TITULO" = 'Pregunta Simple Numero', "TIPO_INPUT" = 'Texto', "ESTADO" = 'En espera'
WHERE "PREGUNTA"."ID_PREGUNTA" IN ('2')
---
            'ESTADO' => $this->request->getVar('estado_simple')
        ];

        if ($preguntaModel->update($aux, $data)){