SPM-Oracle/app/Controllers/Postulante.php

    public function postulantes()
    {
        $session = session();

        $sesion_creada = $session->has('id_administrativo');

        if($sesion_creada==false){
            return redirect()->to('/'); //http://inet.utalca.cl/intranet/auth_sso
        }

        $convocatoriaModel = new ConvocatoriaModel();
        $postulacionModel = new PostulacionModel();
        $estudianteModel = new EstudianteModel();

        $carreraModel = new CarreraModel();
        $programaModel = new ProgramaModel();

        $usuario=[
            'id_administrativo' => session()->get('id_administrativo'),
            'nombre' => session()->get('nombre'),
            'email' => session()->get('email')
        ];

        $convocatorias = $convocatoriaModel->orderBy('ID_CONVOCATORIA', 'DESC')->findAll();

        /**
         * La función paginate muestra un máximo de 25 datos en la tabla, generando un botón para ver los sgtes 25 datos
         */

        $postulaciones_base = $postulacionModel->orderBy('ID_POSTULACION', 'DESC')->paginate(25);
---
SELECT *
FROM "CONVOCATORIA"
ORDER BY "ID_CONVOCATORIA" DESC
SELECT *
FROM "POSTULACION"
ORDER BY "ID_POSTULACION" DESC
 OFFSET 0 ROWS FETCH NEXT 25 ROWS ONLY


            foreach ($postulaciones_base as $aux){

                $estudiante = $estudianteModel->find($aux['ID_ESTUDIANTE']);
                $carrera = $carreraModel -> find($estudiante['ID_CARRERA']);
                $convocatoria = $convocatoriaModel->find($aux['ID_CONVOCATORIA']);
                $programa = $programaModel->find($convocatoria['ID_PROGRAMA']);
---
SELECT *
FROM "ESTUDIANTE"
WHERE "ESTUDIANTE"."ID_ESTUDIANTE" = '1'
SELECT *
FROM "CONVOCATORIA"
WHERE "CONVOCATORIA"."ID_CONVOCATORIA" = '1'
SELECT *
FROM "PROGRAMA"
WHERE "PROGRAMA"."ID_PROGRAMA" = '4'

        # Busca todas las características de la postulación con el aux dado

        $postulacion = $postulacionModel->find($aux);
        $estudiante = $estudianteModel ->find($postulacion['ID_ESTUDIANTE']);
        $convocatoria = $convocatoriaModel->find($postulacion['ID_CONVOCATORIA']);
        $carrera = $carreraModel->find($estudiante['ID_CARRERA']);
        $programa = $programaModel->find($convocatoria['ID_PROGRAMA']);

        $universidades_base = $universidadModel->findAll();
---
SELECT *
FROM "ESTUDIANTE"
WHERE "ESTUDIANTE"."ID_ESTUDIANTE" = '1'
SELECT *
FROM "CONVOCATORIA"
WHERE "CONVOCATORIA"."ID_CONVOCATORIA" = '4'
SELECT *
FROM "CARRERA"
WHERE "CARRERA"."ID_CARRERA" = '419'
SELECT *
FROM "PROGRAMA"
WHERE "PROGRAMA"."ID_PROGRAMA" = '4'
SELECT *
FROM "UNIVERSIDAD"

        $universidad2 = $universidadModel->find($postulacion['SEGUNDA_OPCION']);
        $universidad3 = $universidadModel->find($postulacion['TERCERA_OPCION']);

        $convocatoria = $convocatoriaModel->find($postulacion['ID_CONVOCATORIA']);
---
SELECT *
FROM "CONVOCATORIA"
WHERE "CONVOCATORIA"."ID_CONVOCATORIA" = '4'