SPM-Oracle/app/Controllers/Programa.php

    public function programas()
    {
        $session = session();

        $sesion_creada = $session->has('id_administrativo');

        if($sesion_creada==false){
            return redirect()->to('/'); //http://inet.utalca.cl/intranet/auth_sso
        }

        $programaModel = new ProgramaModel();

        $usuario=[
            'id_administrativo' => session()->get('id_administrativo'),
            'nombre' => session()->get('nombre'),
            'email' => session()->get('email')
        ];

        $programas = $programaModel->paginate(25);
---
SELECT *
FROM "PROGRAMA"
 ORDER BY 1 OFFSET 0 ROWS FETCH NEXT 25 ROWS ONLY