SPM-MySQL/app/Controllers/Admin.php

    public function home()
    {
        #Función Home, muestra la vista de inicio de todas las funciones administrativas

        $session = session();
        $sesion_creada = $session->has('id_administrativo');

        if($sesion_creada==false){
            return redirect()->to('/'); //http://inet.utalca.cl/intranet/auth_sso
        }

        /**
         * Registra la información administrativa en usuario
         */

        $usuario=[
            'id_administrativo' => session()->get('id_administrativo'),
            'nombre' => session()->get('nombre'),
            'email' => session()->get('email')
        ];

        $convocatoriaModel = new ConvocatoriaModel();
        $movilidadModel = new MovilidadModel();
        $programaModel = new ProgramaModel();
        $postulacionModel = new PostulacionModel();

        # Busca la última convocatoria creada

        $convocatoria = $convocatoriaModel->select('*')->orderBy('ID_CONVOCATORIA', 'DESC')->first();
---
SELECT *
FROM `convocatoria`
ORDER BY `ID_CONVOCATORIA` DESC
 LIMIT 1