SPM-MySQL/app/Controllers/Convocatoria.php

            return redirect()->to('admin/convocatorias');
        }

        $preguntas = $preguntaModel->findAll();

        $postulaciones = $postulacionModel->select('*')->where('ID_CONVOCATORIA', $convocatoria['ID_CONVOCATORIA'])->findAll();
        $programa = $programaModel->select('*')->where('ID_PROGRAMA', $convocatoria['ID_PROGRAMA'])->first();
---
SELECT *
FROM `pregunta`
SELECT *
FROM `postulacion`
WHERE `ID_CONVOCATORIA` = '7'
SELECT *
FROM `programa`
WHERE `ID_PROGRAMA` = '1'
 LIMIT 1

            $preguntas = false;
        }

        $pregunta_asociada = $preguntaConvocatoriaModel->where('ID_CONVOCATORIA', $convocatoria['ID_CONVOCATORIA'])->findAll();
---
SELECT *
FROM `pregunta_convocatoria`
WHERE `ID_CONVOCATORIA` = '7'

            $contador = 0;
            foreach($pregunta_asociada as $pa){

                $pregunta = $preguntaModel->find($pa['ID_PREGUNTA']);
---
SELECT *
FROM `pregunta`
WHERE `pregunta`.`ID_PREGUNTA` = '1'