SPM-MySQL/app/Controllers/Postulante.php

SELECT COUNT(*) AS `numrows`
FROM `postulacion`
---
    public function postulantes()
    {
        $session = session();

        $sesion_creada = $session->has('id_administrativo');

        if($sesion_creada==false){
            return redirect()->to('/'); //http://inet.utalca.cl/intranet/auth_sso
        }

        $convocatoriaModel = new ConvocatoriaModel();
        $postulacionModel = new PostulacionModel();
        $estudianteModel = new EstudianteModel();

        $carreraModel = new CarreraModel();
        $programaModel = new ProgramaModel();

        $usuario=[
            'id_administrativo' => session()->get('id_administrativo'),
            'nombre' => session()->get('nombre'),
            'email' => session()->get('email')
        ];

        $convocatorias = $convocatoriaModel->orderBy('ID_CONVOCATORIA', 'DESC')->findAll();

        /**
         * La función paginate muestra un máximo de 25 datos en la tabla, generando un botón para ver los sgtes 25 datos
         */

        $postulaciones_base = $postulacionModel->orderBy('ID_POSTULACION', 'DESC')->paginate(25);

SELECT *
FROM `estudiante`
WHERE `estudiante`.`ID_ESTUDIANTE` = '1'
SELECT *
FROM `convocatoria`
WHERE `convocatoria`.`ID_CONVOCATORIA` = '7'
SELECT *
FROM `programa`
WHERE `programa`.`ID_PROGRAMA` = '1'
---

            foreach ($postulaciones_base as $aux){

                $estudiante = $estudianteModel->find($aux['ID_ESTUDIANTE']);
                $carrera = $carreraModel -> find($estudiante['ID_CARRERA']);
                $convocatoria = $convocatoriaModel->find($aux['ID_CONVOCATORIA']);
                $programa = $programaModel->find($convocatoria['ID_PROGRAMA']);

SELECT *
FROM `estudiante`
WHERE `estudiante`.`ID_ESTUDIANTE` = '1'
SELECT *
FROM `convocatoria`
WHERE `convocatoria`.`ID_CONVOCATORIA` = '7'
SELECT *
FROM `carrera`
WHERE `carrera`.`ID_CARRERA` = '419'
SELECT *
FROM `programa`
WHERE `programa`.`ID_PROGRAMA` = '1'
SELECT *
FROM `universidad`
---
        # Busca todas las características de la postulación con el aux dado

        $postulacion = $postulacionModel->find($aux);
        $estudiante = $estudianteModel ->find($postulacion['ID_ESTUDIANTE']);
        $convocatoria = $convocatoriaModel->find($postulacion['ID_CONVOCATORIA']);
        $carrera = $carreraModel->find($estudiante['ID_CARRERA']);
        $programa = $programaModel->find($convocatoria['ID_PROGRAMA']);

        $universidades_base = $universidadModel->findAll();