app/Controllers/AuthSPM.php

SELECT *
FROM "ADMINISTRATIVO"
WHERE "ID_USUARIO" = '222'
 ORDER BY 1 OFFSET 0 ROWS FETCH NEXT 1 ROWS ONLY
---

        if($usuario['RELACION']=="Administrativo" && $usuario['PASS']==$pw) {

            $administrativo = $administrativoModel->select('*')->where('ID_USUARIO', $usuario['ID_USUARIO'])->first();