app/Controllers/Convocatoria.php

SELECT *
FROM `pregunta`
SELECT *
FROM `convocatoria`
WHERE `convocatoria`.`ID_CONVOCATORIA` = '7'
SELECT *
FROM `postulacion`
WHERE `ID_CONVOCATORIA` = '29'
SELECT *
FROM `programa`
WHERE `ID_PROGRAMA` = '1'
 LIMIT 1
---
            return redirect()->to('admin/convocatorias');
        }

        $preguntas = $preguntaModel->findAll();

        $postulaciones = $postulacionModel->select('*')->where('ID_CONVOCATORIA', $convocatoria['ID_CONVOCATORIA'])->findAll();
        $programa = $programaModel->select('*')->where('ID_PROGRAMA', $convocatoria['ID_PROGRAMA'])->first();

SELECT *
FROM `pregunta_convocatoria`
WHERE `ID_CONVOCATORIA` = '7'
---
    public function modificar_preguntas()
    {
        $session = session();
        $sesion_creada = $session->has('id_administrativo');

        if($sesion_creada==false){
            return redirect()->to('/'); //http://inet.utalca.cl/intranet/auth_sso
        }

        $convocatoriaModel = new ConvocatoriaModel();
        $preguntaConvocatoriaModel = new PreguntaConvocatoriaModel();

        $id_convocatoria = $this->request->getVar('id_conv');
        $convocatoria = $convocatoriaModel->find($id_convocatoria);
        $preguntas_asociadas = $preguntaConvocatoriaModel ->select('*')->where('ID_CONVOCATORIA', $id_convocatoria)->findAll();