app/Controllers/Postulante.php

    public function postulantes()
    {
        $session = session();

        $sesion_creada = $session->has('id_administrativo');

        if($sesion_creada==false){
            return redirect()->to('/'); //http://inet.utalca.cl/intranet/auth_sso
        }

        $convocatoriaModel = new ConvocatoriaModel();
        $postulacionModel = new PostulacionModel();
        $estudianteModel = new EstudianteModel();

        $carreraModel = new CarreraModel();
        $programaModel = new ProgramaModel();

        $usuario=[
            'id_administrativo' => session()->get('id_administrativo'),
            'nombre' => session()->get('nombre'),
            'email' => session()->get('email')
        ];

        $convocatorias = $convocatoriaModel->findAll();

        /**
         * La función paginate muestra un máximo de 25 datos en la tabla, generando un botón para ver los sgtes 25 datos
         */

        $postulaciones_base = $postulacionModel->paginate(25);
        $paginador = $postulacionModel->pager;

        $carreras = $carreraModel->findAll();
        $programas = $programaModel->findAll();
---
SELECT *
FROM `convocatoria`
SELECT *
FROM `postulacion`
 LIMIT 25
SELECT COUNT(*) AS `numrows`
FROM `postulacion`
SELECT *
FROM `carrera`
SELECT *
FROM `programa`


            foreach ($postulaciones_base as $aux){

                $estudiante = $estudianteModel->find($aux['ID_ESTUDIANTE']);
                $carrera = $carreraModel -> find($estudiante['ID_CARRERA']);
                $convocatoria = $convocatoriaModel->find($aux['ID_CONVOCATORIA']);
                $programa = $programaModel->find($convocatoria['ID_PROGRAMA']);
---
SELECT *
FROM `estudiante`
WHERE `estudiante`.`ID_ESTUDIANTE` = '1'
SELECT *
FROM `convocatoria`
WHERE `convocatoria`.`ID_CONVOCATORIA` = '7'
SELECT *
FROM `programa`
WHERE `programa`.`ID_PROGRAMA` = '1'

            ];
        }

        if ($postulacionModel->update($aux, $data)){
---
UPDATE `postulacion` SET `ESTADO` = 'Rechazada', `SELECCION` = 0
WHERE `postulacion`.`ID_POSTULACION` IN ('12')